RAKWireless/RAK-STM32-RUI/boards.txt
# Debug Menu
WisDuoRAK11160Board.menu.debug.l0=Level 0 (Release)
WisDuoRAK11160Board.menu.debug.l0.build.debug_flags=-DCFG_DEBUG=0
WisDuoRAK11160Board.menu.debug.l1=Level 1 (Error Message)
WisDuoRAK11160Board.debug.l1.build.debug_flags=-DCFG_DEBUG=1
WisDuoRAK11160Board.menu.debug.l2=Level 2 (Full Debug)
WisDuoRAK11160Board.menu.debug.l2.build.debug_flags=-DCFG_DEBUG=2
WisDuoRAK11160Board.menu.debug.l3=Level 3 (Segger SystemView)
WisDuoRAK11160Board.menu.debug.l3.build.debug_flags=-DCFG_DEBUG=3
WisDuoRAK11160Board.menu.debug.l3.build.sysview_flags=-DCFG_SYSVIEW=1

WisDuoRAK11160Board.menu.supportat.1=On
WisDuoRAK11160Board.menu.supportat.1.build.support_at_flag=-DSUPPORT_AT
WisDuoRAK11160Board.menu.supportat.2=Off
WisDuoRAK11160Board.menu.supportat.2.build.support_at_flag=-USUPPORT_AT

WisDuoRAK11160Board.menu.supportlora.1=Support LoRaWAN and LoRa P2P
WisDuoRAK11160Board.menu.supportlora.1.build.supportlora=-DSUPPORT_LORA
WisDuoRAK11160Board.menu.supportlora.1.build.supportlora_p2p=-DSUPPORT_LORA_P2P
WisDuoRAK11160Board.menu.supportlora.2=Support LoRaWAN
WisDuoRAK11160Board.menu.supportlora.2.build.supportlora=-DSUPPORT_LORA
WisDuoRAK11160Board.menu.supportlora.2.build.supportlora_p2p=
WisDuoRAK11160Board.menu.supportlora.3=Support LoRa P2P
WisDuoRAK11160Board.menu.supportlora.3.build.supportlora=
WisDuoRAK11160Board.menu.supportlora.3.build.supportlora_p2p=-DSUPPORT_LORA_P2P -DREGION_EU868
WisDuoRAK11160Board.menu.supportlora.4=Not Support
WisDuoRAK11160Board.menu.supportlora.4.build.supportlora=
WisDuoRAK11160Board.menu.supportlora.4.build.supportlora_p2p=

WisDuoRAK11160Board.menu.supportAS923.1=On
WisDuoRAK11160Board.menu.supportAS923.1.build.regionAS923=-DREGION_AS923
WisDuoRAK11160Board.menu.supportAS923.2=Off
WisDuoRAK11160Board.menu.supportAS923.2.build.regionAS923= 

WisDuoRAK11160Board.menu.supportAU915.1=On
WisDuoRAK11160Board.menu.supportAU915.1.build.regionAU915=-DREGION_AU915
WisDuoRAK11160Board.menu.supportAU915.2=Off
WisDuoRAK11160Board.menu.supportAU915.2.build.regionAU915= 

WisDuoRAK11160Board.menu.supportCN470.2=Off
WisDuoRAK11160Board.menu.supportCN470.2.build.regionCN470= 
WisDuoRAK11160Board.menu.supportCN470.1=On
WisDuoRAK11160Board.menu.supportCN470.1.build.regionCN470=-DREGION_CN470

WisDuoRAK11160Board.menu.supportCN779.2=Off
WisDuoRAK11160Board.menu.supportCN779.2.build.regionCN779= 
WisDuoRAK11160Board.menu.supportCN779.1=On
WisDuoRAK11160Board.menu.supportCN779.1.build.regionCN779=-DREGION_CN779

WisDuoRAK11160Board.menu.supportEU433.2=Off
WisDuoRAK11160Board.menu.supportEU433.2.build.regionEU433= 
WisDuoRAK11160Board.menu.supportEU433.1=On
WisDuoRAK11160Board.menu.supportEU433.1.build.regionEU433=-DREGION_EU433

WisDuoRAK11160Board.menu.supportEU868.1=On
WisDuoRAK11160Board.menu.supportEU868.1.build.regionEU868=-DREGION_EU868
WisDuoRAK11160Board.menu.supportEU868.2=Off
WisDuoRAK11160Board.menu.supportEU868.2.build.regionEU868= 

WisDuoRAK11160Board.menu.supportKR920.1=On
WisDuoRAK11160Board.menu.supportKR920.1.build.regionKR920=-DREGION_KR920
WisDuoRAK11160Board.menu.supportKR920.2=Off
WisDuoRAK11160Board.menu.supportKR920.2.build.regionKR920= 

WisDuoRAK11160Board.menu.supportIN865.1=On
WisDuoRAK11160Board.menu.supportIN865.1.build.regionIN865=-DREGION_IN865
WisDuoRAK11160Board.menu.supportIN865.2=Off
WisDuoRAK11160Board.menu.supportIN865.2.build.regionIN865= 

WisDuoRAK11160Board.menu.supportUS915.1=On
WisDuoRAK11160Board.menu.supportUS915.1.build.regionUS915=-DREGION_US915
WisDuoRAK11160Board.menu.supportUS915.2=Off
WisDuoRAK11160Board.menu.supportUS915.2.build.regionUS915= 

WisDuoRAK11160Board.menu.supportRU864.1=On
WisDuoRAK11160Board.menu.supportRU864.1.build.regionRU864=-DREGION_RU864
WisDuoRAK11160Board.menu.supportRU864.2=Off
WisDuoRAK11160Board.menu.supportRU864.2.build.regionRU864= 

WisDuoRAK11160Board.menu.supportLA915.1=On
WisDuoRAK11160Board.menu.supportLA915.1.build.regionLA915=-DREGION_LA915
WisDuoRAK11160Board.menu.supportLA915.2=Off
WisDuoRAK11160Board.menu.supportLA915.2.build.regionLA915=
 
WisDuoRAK3172EvaluationBoard.menu.support246xuart.2=Off
WisDuoRAK3172EvaluationBoard.menu.support246xuart.2.build.support_246x_uart=
